output/49.inspect.mmd
flowchart LR
  ENTRY([ENTRY])
  STOP([STOP])
  S1["State 1 [entry]<br/>#1 version-define: local r_v1_1 = true<br/>#2 epoch-start: local r_v2_1 = r_v1_1<br/>#3 version-define: local r_v3_1 = false<br/>#4 epoch-start: local r_v4_1 = 'ok'<br/>#5 version-define: local r_v1_2 = { r_v3_1, r_v4_1 }<br/>#6 epoch-mutate: r_v4_1 = r_v1_2<br/>#7 version-define: local r_v1_3 = 'ok'<br/>#8 epoch-start: local r_v5_1 = r_v1_3<br/>#9 epoch-start: local r_v6_1 = 2<br/>#10 epoch-start: local r_v7_1 = r_v6_1<br/>#11 epoch-start: local r_v6_2 = 1<br/>#12 epoch-start: local r_v8_1 = r_v6_2<br/>#13 epoch-start: local r_v6_3 = 0<br/>#14 epoch-start: local r_v9_1 = r_v8_1  r_v6_3<br/>#15 version-define: local r_v3_2 = 1<br/>#16 epoch-mutate: r_v6_2 = r_v3_2 - r_v8_1<br/>#17 epoch-start: local r_v10_1 = args<br/>#18 state-transition: state = 2"]
  S2["State 2<br/>#1 epoch-start: local r_v11_1 = not r_v9_1<br/>#2 epoch-mutate: r_v6_2 = r_v6_2 + r_v8_1<br/>#3 version-define: local r_v3_3 = r_v6_2 = r_v7_1<br/>#4 version-define: local r_v3_4 = r_v11_1 and r_v3_3<br/>#5 epoch-start: local r_v11_2 = r_v6_2 = r_v7_1<br/>#6 epoch-mutate: r_v11_2 = r_v9_1 and r_v11_2<br/>#7 version-define: local r_v3_5 = r_v11_2 or r_v3_4<br/>#8 epoch-start: local r_v11_3 = 3<br/>#9 version-define: local r_v1_4 = r_v3_5 and r_v11_3<br/>#10 version-define: local r_v3_6 = 4<br/>#11 state-transition: state = r_v1_4 or r_v3_6"]
  S3["State 3<br/>#1 state-transition: state = r_v2_1 and 5 or 6<br/>#2 version-define: local r_v3_7 = r_v2_1<br/>#3 epoch-start: local r_v11_4 = r_v6_2"]
  S4["State 4<br/>#1 epoch-start: local r_v6_4 = 'print'<br/>#2 version-define: local r_v1_5 = _env[r_v6_4]<br/>#3 epoch-start: local r_v7_2 = 'chain'<br/>#4 epoch-mutate: r_v6_4 = r_v1_5(r_v7_2, r_v2_1)<br/>#5 epoch-kill: r_v5_1 = nil<br/>#6 epoch-kill: r_v4_1 = nil<br/>#7 epoch-kill: r_v2_1 = nil<br/>#8 return-payload: ReturnVal = {}<br/>#9 state-transition: state = nil"]
  S5["State 5<br/>#1 epoch-start: local r_v12_1 = 1<br/>#2 epoch-start: local r_v13_1 = r_v4_1[r_v12_1]<br/>#3 epoch-start: local r_v12_2 = false<br/>#4 epoch-start: local r_v14_1 = r_v13_1 == r_v12_2<br/>#5 epoch-start: local r_v15_1 = state<br/>#6 state-transition: state = r_v14_1 and 7 or 8<br/>#7 epoch-start: local r_v16_1 = r_v14_1"]
  S6["State 6<br/>#1 epoch-start: local r_v16_2 = 'print'<br/>#2 version-define: local r_v1_6 = _env[r_v16_2]<br/>#3 epoch-start: local r_v15_2 = 'i'<br/>#4 epoch-mutate: r_v16_2 = r_v1_6(r_v15_2, r_v11_4)<br/>#5 epoch-mutate: r_v2_1 = ReturnVal<br/>#6 epoch-kill: r_v11_4 = nil<br/>#7 state-transition: state = 2"]
  S7["State 7<br/>#1 epoch-start: local r_v12_3 = 2<br/>#2 epoch-start: local r_v13_2 = r_v4_1[r_v12_3]<br/>#3 epoch-start: local r_v14_2 = r_v13_2 == r_v5_1<br/>#4 epoch-mutate: r_v16_1 = r_v14_2<br/>#5 state-transition: state = 8"]
  S8["State 8<br/>#1 version-define: local r_v1_7 = r_v15_1<br/>#2 version-define: local r_v3_8 = r_v16_1<br/>#3 state-transition: state = 6"]
  ENTRY --> S1
  S1 --> S2
  S2 -->|true| S3
  S2 -->|false| S4
  S3 -->|true| S5
  S3 -->|false| S6
  S4 --> STOP
  S5 -->|true| S7
  S5 -->|false| S8
  S6 --> S2
  S7 --> S8
  S8 --> S6
  L0(["r3 = r_v2_1"])
  L0 -. start .-> S1
  L0 -. read/read .-> S3
  L0 -. read/kill .-> S4
  L0 -. mutate .-> S6
  L1(["r14 = r_v4_1"])
  L1 -. start/read/mutate .-> S1
  L1 -. kill .-> S4
  L1 -. read .-> S5
  L1 -. read .-> S7
  L2(["r10 = r_v5_1"])
  L2 -. start .-> S1
  L2 -. kill .-> S4
  L2 -. read .-> S7
  L3(["r2 = r_v6_1"])
  L3 -. start/read .-> S1
  L4(["r2 = r_v6_2"])
  L4 -. start/read/mutate .-> S1
  L4 -. read/mutate/read/read .-> S2
  L4 -. read .-> S3
  L5(["r2 = r_v6_3"])
  L5 -. start/read .-> S1
  L6(["r2 = r_v6_4"])
  L6 -. start/read/mutate .-> S4
  L7(["r9 = r_v7_1"])
  L7 -. start .-> S1
  L7 -. read/read .-> S2
  L8(["r9 = r_v7_2"])
  L8 -. start/read .-> S4
  L9(["r5 = r_v8_1"])
  L9 -. start/read/read .-> S1
  L9 -. read .-> S2
  L10(["r7 = r_v9_1"])
  L10 -. start .-> S1
  L10 -. read/read .-> S2
  L11(["r12 = r_v10_1"])
  L11 -. start .-> S1
  L12(["r6 = r_v11_1"])
  L12 -. start/read .-> S2
  L13(["r6 = r_v11_2"])
  L13 -. start/read/mutate/read .-> S2
  L14(["r6 = r_v11_3"])
  L14 -. start/read .-> S2
  L15(["r6 = r_v11_4"])
  L15 -. start .-> S3
  L15 -. read/kill .-> S6
  L16(["r4 = r_v12_1"])
  L16 -. start/read .-> S5
  L17(["r4 = r_v12_2"])
  L17 -. start/read .-> S5
  L18(["r4 = r_v12_3"])
  L18 -. start/read .-> S7
  L19(["r8 = r_v13_1"])
  L19 -. start/read .-> S5
  L20(["r8 = r_v13_2"])
  L20 -. start/read .-> S7
  L21(["r11 = r_v14_1"])
  L21 -. start/read/read .-> S5
  L22(["r11 = r_v14_2"])
  L22 -. start/read .-> S7
  L23(["r13 = r_v15_1"])
  L23 -. start .-> S5
  L23 -. read .-> S8
  L24(["r13 = r_v15_2"])
  L24 -. start/read .-> S6
  L25(["r1 = r_v16_1"])
  L25 -. start .-> S5
  L25 -. mutate .-> S7
  L25 -. read .-> S8
  L26(["r1 = r_v16_2"])
  L26 -. start/read/mutate .-> S6
